{
  "app": {
    "name": "Field Dependency Filter",
    "short_description": "Filters dropdown options by parent field selection in Zendesk tickets.",
    "long_description": "### Field Dependency Filter for Zendesk\n\nBraamcamp is dedicated to building smart, user-friendly solutions that enhance customer support workflows. Our mission is to empower support teams with tools that simplify complex processes, improve agent efficiency, and deliver better customer experiences.\n\n---\n\n**Field Dependency Filter** is a Zendesk app that automatically filters dropdown field options in tickets based on parent field selections. This ensures agents only see relevant choices, streamlining ticket creation and reducing errors.\n\n**Key Features:**\n\n* Dynamically filters child dropdown options according to the selected parent field value\n* Easy configuration of custom filter rules to match your business logic\n* Supports complex field dependencies for advanced workflows\n* Improves agent efficiency and accuracy\n* Reduces clutter and confusion in ticket forms\n\n**How it works:**\n\nWhen an agent selects a value in a parent dropdown field, only the relevant options will appear in the dependent child field. This guides agents through the ticket process, ensuring they select valid and context-sensitive options.\n\n**Getting Started:**\n\n1. Install the app in your Zendesk account\n2. Configure your filter rules in the app settings\n3. Save and reload your ticket interface to activate filtering\n\n---\n\n**Data Disclosure & Privacy Notice**\n\nField Dependency Filter accesses and processes the following data within your Zendesk account:\n\n* Ticket field metadata (field IDs, option values)\n* Agent selections in ticket forms\n* Filter rules configured by administrators\n\nNo ticket content, user data, or sensitive information is stored or transmitted outside your Zendesk instance. All processing occurs client-side within the Zendesk interface.\n\nFor more information, please review our [Privacy Policy](https://github.com/braamcamp/zendesk-field-dependency-filter/blob/main/PRIVACY.md) or contact support for details about data handling and compliance.\n\n---\n\nField Dependency Filter is ideal for support teams that need to guide agents through complex ticket creation processes with context-sensitive field options. Simplify your Zendesk experience and improve your workflow today!\n",
    "installation_instructions": "### Installation Instructions\n\n1. **Install the app package** to your Zendesk account via the Admin Center.\n2. **Configure the filter rules** in the app settings according to your field dependencies.\n3. **Save and reload** your ticket interface to activate the filtering.\n\nFor more details, refer to the [README](https://github.com/braamcamp/zendesk-field-dependency-filter/blob/main/README.md) or contact support.",
    "parameters": {
      "filter_rules" : { "label": "Filter Rules", "helpText": "One JSON object per parent→child pair. parent/child are dropdown field IDs. mapping keeps parent option tags as keys with arrays of allowed child option tags. Example: {\"rules\":[{\"name\":\"Reason -> Subreason\",\"parent\":\"123\",\"child\":\"456\",\"mapping\":{\"reason1\":[\"subreason1\",\"subreason2\",\"subreason3\"],\"reason2\":[\"subreason4\",\"subreason5\",\"subreason6\"]}}]}" }
    }
  }
}
